In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]], index = ['a','b','c','d'],columns = ['one','two'])

In [3]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [7]:
df.sum(axis=1,skipna = False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [11]:
df.idxmax(skipna = False)

one   NaN
two   NaN
dtype: float64

In [12]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [13]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [14]:
obj = pd.Series(['a','a','b','c']*4)

In [15]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [16]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [17]:
import pandas_datareader.data as web

In [18]:
all_data = {ticker:web.get_data_yahoo(ticker) 
            for ticker in ['AAPL','IBM','MSFT','GOOG']}

In [20]:
price = pd.DataFrame({ticker:data['Adj Close'] 
                      for ticker,data in all_data.items()})

In [25]:
volume = pd.DataFrame({ticker:data['Volume']
                      for ticker,data in all_data.items()})

In [26]:
returns = price.pct_change()

In [27]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-03-03 -0.031759 -0.040209 -0.047919 -0.034353
2020-03-04  0.046385  0.041272  0.036715  0.033644
2020-03-05 -0.032437 -0.034794 -0.025095 -0.048669
2020-03-06 -0.013280 -0.014049 -0.028267 -0.015640
2020-03-09 -0.047054 -0.055417 -0.027852 -0.048020

In [28]:
returns['MSFT'].corr(returns['IBM'])

0.4889218935876256

In [29]:
returns['MSFT'].cov(returns['IBM'])

9.774838382673041e-05

In [30]:
returns.MSFT.corr(returns.IBM)

0.4889218935876256

In [31]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.421281  0.610382  0.559121
IBM   0.421281  1.000000  0.488922  0.433525
MSFT  0.610382  0.488922  1.000000  0.687844
GOOG  0.559121  0.433525  0.687844  1.000000

In [32]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000259  0.000091  0.000147  0.000139
IBM   0.000091  0.000179  0.000098  0.000089
MSFT  0.000147  0.000098  0.000223  0.000158
GOOG  0.000139  0.000089  0.000158  0.000237

In [33]:
returns.corrwith(returns.IBM)

AAPL    0.421281
IBM     1.000000
MSFT    0.488922
GOOG    0.433525
dtype: float64

In [38]:
returns.corrwith(volume)

AAPL   -0.143037
IBM    -0.090512
MSFT   -0.048488
GOOG   -0.025516
dtype: float64

In [39]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])

In [60]:
uniques = obj.unique()

In [61]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [62]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [63]:
pd.value_counts(obj.values,sort = False)

b    2
d    1
a    3
c    3
dtype: int64

In [64]:
mask = obj.isin(['b','c'])

In [65]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [67]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [68]:
to_match = pd.Series(['c','a','b','b','c','a'])

In [69]:
unique_vals = pd.Series(['c','b','a'])

In [70]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [71]:
data = pd.DataFrame({'qu1':[1,3,4,3,4],'qu2':[2,3,1,2,3],'qu3':[1,5,2,4,4]})

In [72]:
data

   qu1  qu2  qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [77]:
result = data.apply(pd.value_counts).fillna(0)

In [78]:
result

   qu1  qu2  qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [79]:
pd.options.display.max_rows = 10

In [80]:
result = pd.read_csv('F:/利用Python进行数据分析数据集/examples/ex6.csv')

In [81]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [83]:
pd.read_csv('F:/利用Python进行数据分析数据集/examples/ex6.csv',nrows=10)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [112]:
result = result['key'].count()

AttributeError: 'numpy.int64' object has no attribute 'count'

In [107]:
result

one      10000
two      10000
three    10000
four     10000
key      10000
dtype: int64

In [86]:
tot = pd.Series([])

In [98]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value = 0)

In [99]:
tot[:10]

Series([], dtype: object)

Series([], dtype: object)

In [113]:
chunker = pd.read_csv('F:/利用Python进行数据分析数据集/examples/ex6.csv',chunksize = 1000)
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value = 0)
tot = tot.sort_values(ascending = False)

In [114]:
tot

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

In [118]:
data  = pd.read_csv('F:/利用Python进行数据分析数据集/examples/ex5.csv')

In [119]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [121]:
data.to_csv('F:/利用Python进行数据分析数据集/examples/out.csv')

In [122]:
data = pd.read_csv('F:/利用Python进行数据分析数据集/examples/out.csv')

In [123]:
data

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [124]:
import sys

In [125]:
data.to_csv(sys.stdout,sep = '|')

|Unnamed: 0|something|a|b|c|d|message
0|0|one|1|2|3.0|4|
1|1|two|5|6||8|world
2|2|three|9|10|11.0|12|foo

In [127]:
data.to_csv(sys.stdout,index = False,columns = ['a','b','message'])

a,b,message
1,2,
5,6,world
9,10,foo

In [129]:
dates = pd.date_range('1/1/2000',periods = 7)

In [130]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [131]:
ts = pd.Series(np.arange(7),index = dates)

In [132]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [133]:
import csv

In [134]:
f = open('F:/利用Python进行数据分析数据集/examples/ex7.csv')

In [135]:
reader = csv.reader(f)

In [136]:
reader

In [137]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [138]:
with open('F:/利用Python进行数据分析数据集/examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [139]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [143]:
header,values = lines[0],lines[1:]

In [144]:
data_dict = {h:v for h,v in zip(header,zip(*values))}

In [145]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [146]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
reader= csv.reader(f,dialect = my_dialect)

TypeError: argument 1 must be an iterator